{
  "103909": "No specific cost-of-illness study for Trehalase deficiency was identified, but a peer-reviewed pan-European analysis reported an average annual cost of €37,187 per rare disease patient in Spain, and a European industry report estimated a €107,000 per patient per year burden across 23 rare diseases, providing medium-high evidence for significant economic impact. (https://pubmed.ncbi.nlm.nih.gov/37283971/)",
  "139": "No peer-reviewed cost-of-illness studies were found; evidence is limited to qualitative case reports describing severe unilateral skin lesions, limb defects, and chronic management needs indicating high clinical burden; therefore, a low evidence score was assigned. (https://pubmed.ncbi.nlm.nih.gov/7408908/)",
  "158": "Only qualitative evidence is available, from a Dutch study reporting psychological burden and uncertainty related to lifelong monitoring and treatment; no cost-of-illness studies were identified. (https://pubmed.ncbi.nlm.nih.gov/37268964/)",
  "2209": "A peer-reviewed Spanish cost-of-illness study reported mean annual healthcare costs of €4239 per patient (2019), supported by regional Catalonia data (€667/year) and a nationwide French analysis (€11,144/year), providing robust Spain-specific and high-quality evidence. (https://doi.org/10.1007/s40261-019-00760-1)",
  "26793": "A single qualitative caregiver study from the USA (2023) reported financial constraints and impacts on ability to work but provided no quantitative cost data, indicating low evidence of socioeconomic burden. (https://doi.org/10.3390/ijns9040053)",
  "272": "No cost-of-illness or quantitative economic data specific to FCMD were identified. Clinical reviews and Orphanet entries document severe disability, epilepsy, and high care needs, indicating substantial qualitative burden. citeturn3view0turn1search0 (https://pubmed.ncbi.nlm.nih.gov/24305446/)",
  "333": "No quantitative cost-of-illness studies were identified for Farber disease; the available evidence is limited to qualitative descriptions of severe clinical burden from peer-reviewed and patient-organisation sources. (https://ojrd.biomedcentral.com/articles/10.1186/s13023-018-0845-z)",
  "35122": "Only qualitative descriptions of burden from patient journey reports citeturn0search3 and program information on financial concerns and assistance citeturn0search0turn0search1 were identified, with no peer-reviewed cost-of-illness studies specific to CSID. (https://pmc.ncbi.nlm.nih.gov/articles/PMC8298246/)",
  "369": "Only qualitative descriptive clinical studies are available describing disease burden and long-term outcomes, with no peer-reviewed cost-of-illness data for GSD VI, thus assigned a low evidence level. (https://pubmed.ncbi.nlm.nih.gov/25266922/)",
  "42": "A peer-reviewed economic analysis from a high-income country (France) provided annual treatment cost estimates (€5,831 per patient for L-carnitine supplementation and consultations), fitting the criteria for medium-high evidence. (https://bmcpediatr.biomedcentral.com/articles/10.1186/1471-2431-12-60)",
  "469": "No peer-reviewed cost-of-illness studies specific to hereditary fructose intolerance were identified; available evidence is limited to qualitative and indirect quantitative data from patient surveys and quality-of-life assessments without direct cost figures in euros. (https://doi.org/10.1016/j.endien.2020.06.004)",
  "602": "Only qualitative descriptions of severe burden are available from patient-reported outcome and observational natural history studies, with no quantitative cost data identified. (https://pubmed.ncbi.nlm.nih.gov/28637129)",
  "709": "Only qualitative descriptions of severe disease burden were identified in clinical reviews without any quantitative cost estimates provided. (https://www.ncbi.nlm.nih.gov/books/NBK1464/)",
  "79318": "Only qualitative descriptions of severe burden were found, including reports on mortality risk, quality of life impact, and supportive care needs, but no quantitative cost-of-illness data specific to PMM2-CDG. (https://www.ncbi.nlm.nih.gov/books/NBK1110/)",
  "79432": "Only qualitative studies describing impairment in quality of life and financial or access challenges were identified; no quantitative cost-of-illness data were available. (https://doi.org/10.1590/abd1806-4841.20153498)",
  "79433": "Only qualitative evidence from two peer-reviewed vision-related quality-of-life studies was found, with no quantitative cost data available indicating a severe burden but lacking cost-of-illness analyses. (https://doi.org/10.1016/j.jaapos.2008.10.008)",
  "79435": "No peer-reviewed cost-of-illness study specific to Spain or other high-income country was identified; available evidence consists of an out-of-pocket expenditure study from Turkey and a qualitative burden assessment tool study in France. (https://pmc.ncbi.nlm.nih.gov/articles/PMC10020592/)",
  "816": "Only qualitative evidence exists, notably a 2019 Dutch study reporting quality of life and daily functioning without cost data, indicating severe burden but no quantitative cost estimates.citeturn4view0 (https://pubmed.ncbi.nlm.nih.gov/30609437/)"
}